profiling/stage_2/status_while_get_wrk.txt
Running 30s test @ http://127.0.0.1:8080/v0/status
  4 threads and 1024 connections
  Thread calibration: mean lat.: 18.708ms, rate sampling interval: 53ms
  Thread calibration: mean lat.: 12.604ms, rate sampling interval: 52ms
  Thread calibration: mean lat.: 81.337ms, rate sampling interval: 556ms
  Thread calibration: mean lat.: 10.181ms, rate sampling interval: 46ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.62ms   11.70ms 260.86ms   90.14%
    Req/Sec    25.11k     2.16k   32.67k    72.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.16ms
 75.000%   11.87ms
 90.000%   21.18ms
 99.000%   55.52ms
 99.900%  106.11ms
 99.990%  228.86ms
 99.999%  255.74ms
100.000%  260.99ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.055     0.000000            1         1.00
       1.524     0.100000       186039         1.11
       2.435     0.200000       372189         1.25
       3.495     0.300000       557958         1.43
       4.715     0.400000       744270         1.67
       6.155     0.500000       929991         2.00
       6.991     0.550000      1023101         2.22
       7.911     0.600000      1115748         2.50
       8.975     0.650000      1208964         2.86
      10.271     0.700000      1301950         3.33
      11.871     0.750000      1395021         4.00
      12.807     0.775000      1441333         4.44
      13.927     0.800000      1487670         5.00
      15.279     0.825000      1534284         5.71
      16.863     0.850000      1580965         6.67
      18.767     0.875000      1627375         8.00
      19.887     0.887500      1650390         8.89
      21.183     0.900000      1673687        10.00
      22.655     0.912500      1696912        11.43
      24.431     0.925000      1720098        13.33
      26.671     0.937500      1743286        16.00
      27.967     0.943750      1754934        17.78
      29.439     0.950000      1766574        20.00
      31.263     0.956250      1778157        22.86
      33.471     0.962500      1789896        26.67
      36.159     0.968750      1801389        32.00
      37.791     0.971875      1807200        35.56
      39.615     0.975000      1813019        40.00
      41.727     0.978125      1818862        45.71
      44.223     0.981250      1824647        53.33
      47.455     0.984375      1830507        64.00
      49.247     0.985938      1833369        71.11
      51.327     0.987500      1836283        80.00
      53.887     0.989062      1839167        91.43
      56.831     0.990625      1842075       106.67
      60.319     0.992188      1844978       128.00
      62.367     0.992969      1846419       142.22
      64.735     0.993750      1847882       160.00
      67.519     0.994531      1849344       182.86
      70.271     0.995313      1850802       213.33
      73.791     0.996094      1852250       256.00
      75.391     0.996484      1852968       284.44
      77.695     0.996875      1853691       320.00
      80.703     0.997266      1854424       365.71
      83.775     0.997656      1855150       426.67
      87.615     0.998047      1855869       512.00
      89.727     0.998242      1856233       568.89
      92.863     0.998437      1856591       640.00
      95.743     0.998633      1856953       731.43
     100.351     0.998828      1857315       853.33
     107.519     0.999023      1857678      1024.00
     111.295     0.999121      1857863      1137.78
     116.415     0.999219      1858044      1280.00
     125.503     0.999316      1858222      1462.86
     142.591     0.999414      1858404      1706.67
     158.463     0.999512      1858589      2048.00
     165.887     0.999561      1858677      2275.56
     174.207     0.999609      1858767      2560.00
     184.831     0.999658      1858858      2925.71
     197.375     0.999707      1858950      3413.33
     207.743     0.999756      1859040      4096.00
     211.583     0.999780      1859086      4551.11
     215.167     0.999805      1859132      5120.00
     217.727     0.999829      1859177      5851.43
     221.567     0.999854      1859222      6826.67
     224.639     0.999878      1859267      8192.00
     226.431     0.999890      1859290      9102.22
     229.887     0.999902      1859312     10240.00
     234.879     0.999915      1859336     11702.86
     238.975     0.999927      1859357     13653.33
     244.735     0.999939      1859380     16384.00
     246.527     0.999945      1859391     18204.44
     247.935     0.999951      1859405     20480.00
     249.855     0.999957      1859414     23405.71
     251.135     0.999963      1859426     27306.67
     251.775     0.999969      1859437     32768.00
     252.159     0.999973      1859442     36408.89
     254.079     0.999976      1859449     40960.00
     254.335     0.999979      1859456     46811.43
     254.463     0.999982      1859461     54613.33
     254.719     0.999985      1859465     65536.00
     255.103     0.999986      1859468     72817.78
     255.359     0.999988      1859473     81920.00
     255.743     0.999989      1859474     93622.86
     256.383     0.999991      1859476    109226.67
     256.767     0.999992      1859480    131072.00
     256.895     0.999993      1859482    145635.56
     256.895     0.999994      1859482    163840.00
     257.151     0.999995      1859484    187245.71
     257.407     0.999995      1859485    218453.33
     257.535     0.999996      1859486    262144.00
     258.047     0.999997      1859487    291271.11
     258.175     0.999997      1859488    327680.00
     258.687     0.999997      1859489    374491.43
     258.687     0.999998      1859489    436906.67
     259.071     0.999998      1859490    524288.00
     259.071     0.999998      1859490    582542.22
     259.455     0.999998      1859491    655360.00
     259.455     0.999999      1859491    748982.86
     259.455     0.999999      1859491    873813.33
     259.711     0.999999      1859492   1048576.00
     259.711     0.999999      1859492   1165084.44
     259.711     0.999999      1859492   1310720.00
     259.711     0.999999      1859492   1497965.71
     259.711     0.999999      1859492   1747626.67
     260.991     1.000000      1859493   2097152.00
     260.991     1.000000      1859493          inf
#[Mean    =        9.616, StdDeviation   =       11.705]
#[Max     =      260.864, Total count    =      1859493]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2896386 requests in 30.00s, 290.03MB read
  Socket errors: connect 7, read 0, write 0, timeout 98
Requests/sec:  96542.31
Transfer/sec:      9.67MB