profiling/stage_2/status_wrk.txt
Running 30s test @ http://127.0.0.1:8080/v0/status
  4 threads and 1024 connections
  Thread calibration: mean lat.: 1.565ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.568ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.716ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.557ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.48ms  713.75us  21.65ms   70.75%
    Req/Sec    26.15k     3.01k   44.56k    78.14%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.39ms
 75.000%    1.91ms
 90.000%    2.37ms
 99.000%    3.32ms
 99.900%    5.88ms
 99.990%   11.35ms
 99.999%   14.80ms
100.000%   21.66ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.036     0.000000            1         1.00
       0.666     0.100000       186309         1.11
       0.865     0.200000       372425         1.25
       1.040     0.300000       558349         1.43
       1.214     0.400000       743792         1.67
       1.392     0.500000       930288         2.00
       1.485     0.550000      1022937         2.22
       1.582     0.600000      1115855         2.50
       1.684     0.650000      1208974         2.86
       1.791     0.700000      1302036         3.33
       1.908     0.750000      1394354         4.00
       1.972     0.775000      1440921         4.44
       2.039     0.800000      1487538         5.00
       2.109     0.825000      1533789         5.71
       2.185     0.850000      1580548         6.67
       2.271     0.875000      1627264         8.00
       2.319     0.887500      1650579         8.89
       2.371     0.900000      1673973        10.00
       2.427     0.912500      1696531        11.43
       2.493     0.925000      1720211        13.33
       2.567     0.937500      1743422        16.00
       2.609     0.943750      1754911        17.78
       2.653     0.950000      1766089        20.00
       2.705     0.956250      1777786        22.86
       2.765     0.962500      1789506        26.67
       2.835     0.968750      1801004        32.00
       2.877     0.971875      1806873        35.56
       2.925     0.975000      1812683        40.00
       2.983     0.978125      1818516        45.71
       3.051     0.981250      1824323        53.33
       3.129     0.984375      1830053        64.00
       3.173     0.985938      1832916        71.11
       3.223     0.987500      1835853        80.00
       3.279     0.989062      1838761        91.43
       3.351     0.990625      1841635       106.67
       3.455     0.992188      1844505       128.00
       3.527     0.992969      1845965       142.22
       3.621     0.993750      1847433       160.00
       3.747     0.994531      1848860       182.86
       3.919     0.995313      1850312       213.33
       4.131     0.996094      1851775       256.00
       4.251     0.996484      1852499       284.44
       4.395     0.996875      1853218       320.00
       4.567     0.997266      1853955       365.71
       4.747     0.997656      1854669       426.67
       4.987     0.998047      1855402       512.00
       5.115     0.998242      1855762       568.89
       5.263     0.998437      1856132       640.00
       5.431     0.998633      1856490       731.43
       5.643     0.998828      1856851       853.33
       5.915     0.999023      1857211      1024.00
       6.067     0.999121      1857396      1137.78
       6.231     0.999219      1857583      1280.00
       6.451     0.999316      1857757      1462.86
       6.767     0.999414      1857937      1706.67
       7.235     0.999512      1858120      2048.00
       7.551     0.999561      1858210      2275.56
       7.959     0.999609      1858300      2560.00
       8.583     0.999658      1858394      2925.71
       9.079     0.999707      1858483      3413.33
       9.599     0.999756      1858573      4096.00
       9.871     0.999780      1858618      4551.11
      10.159     0.999805      1858665      5120.00
      10.455     0.999829      1858710      5851.43
      10.719     0.999854      1858755      6826.67
      11.063     0.999878      1858801      8192.00
      11.239     0.999890      1858824      9102.22
      11.391     0.999902      1858846     10240.00
      11.623     0.999915      1858868     11702.86
      11.911     0.999927      1858890     13653.33
      12.263     0.999939      1858913     16384.00
      12.471     0.999945      1858924     18204.44
      12.703     0.999951      1858936     20480.00
      12.943     0.999957      1858947     23405.71
      13.303     0.999963      1858958     27306.67
      13.487     0.999969      1858970     32768.00
      13.551     0.999973      1858975     36408.89
      13.775     0.999976      1858982     40960.00
      13.935     0.999979      1858987     46811.43
      14.191     0.999982      1858992     54613.33
      14.327     0.999985      1858998     65536.00
      14.455     0.999986      1859001     72817.78
      14.623     0.999988      1859004     81920.00
      14.799     0.999989      1859007     93622.86
      14.951     0.999991      1859009    109226.67
      15.159     0.999992      1859012    131072.00
      15.263     0.999993      1859014    145635.56
      15.335     0.999994      1859015    163840.00
      15.879     0.999995      1859017    187245.71
      19.759     0.999995      1859018    218453.33
      19.855     0.999996      1859019    262144.00
      20.191     0.999997      1859020    291271.11
      20.255     0.999997      1859021    327680.00
      20.367     0.999997      1859022    374491.43
      20.367     0.999998      1859022    436906.67
      20.927     0.999998      1859023    524288.00
      20.927     0.999998      1859023    582542.22
      21.439     0.999998      1859024    655360.00
      21.439     0.999999      1859024    748982.86
      21.439     0.999999      1859024    873813.33
      21.519     0.999999      1859025   1048576.00
      21.519     0.999999      1859025   1165084.44
      21.519     0.999999      1859025   1310720.00
      21.519     0.999999      1859025   1497965.71
      21.519     0.999999      1859025   1747626.67
      21.663     1.000000      1859026   2097152.00
      21.663     1.000000      1859026          inf
#[Mean    =        1.478, StdDeviation   =        0.714]
#[Max     =       21.648, Total count    =      1859026]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2875482 requests in 30.00s, 287.94MB read
  Socket errors: connect 7, read 0, write 0, timeout 98
Requests/sec:  95844.39
Transfer/sec:      9.60MB